**Studi Kasus 3: Era Pandas (Tugas yang Sama, Alat Berbeda)**

**Tujuan Anda adalah melakukan hal yang sama persis seperti kemarin, tapi sekarang Anda adalah seorang Analis Data yang sudah mengenal Pandas.**

-----

In [1]:
# Data Awal Anda (Sama seperti kemarin)
import pandas as pd # <-- Langkah baru

data_mahasiswa = [
    {'id': 'M001', 'nama': 'Budi', 'nilai_uts': 85, 'nilai_uas': 90},
    {'id': 'M002', 'nama': 'Ani', 'nilai_uts': 70, 'nilai_uas': 85},
    {'id': 'M003', 'nama': 'Candra', 'nilai_uts': 90, 'nilai_uas': 'BELUM_UJIAN'},
    {'id': 'M004', 'nama': 'Dewi', 'nilai_uts': 50, 'nilai_uas': 65}
]

----

**Persiapan: Membuat DataFrame**

**Tugas: Ubah list data_mahasiswa di atas menjadi sebuah DataFrame Pandas. Beri nama df_mahasiswa.**
- Petunjuk: Cukup gunakan pd.DataFrame(nama_list_anda).
- Setelah selesai, cetak (print) df_mahasiswa untuk melihat hasilnya.

In [2]:
data_mahasiswa_df =  pd.DataFrame(data_mahasiswa)

print("Data Mahasiswa Awal:", data_mahasiswa_df, sep="\n")

Data Mahasiswa Awal:
     id    nama  nilai_uts    nilai_uas
0  M001    Budi         85           90
1  M002     Ani         70           85
2  M003  Candra         90  BELUM_UJIAN
3  M004    Dewi         50           65

----

**Menghitung Nilai Akhir (Operasi Vektor) Ingat rumus: nilai_akhir = 40% Nilai UTS + 60% Nilai UAS.**

**Tugas: Buat satu kolom baru bernama `nilai_akhir` di `data_mahasiswa_df` Anda.**

- Proses:
- Anda akan sadar bahwa kolom `nilai_uas` tidak bisa langsung dikalikan karena ada teks 'BELUM_UJIAN'. (Ini masalah yang sama dengan kemarin).
- Kunci Pandas: Daripada for loop dan isinstance, gunakan pd.to_numeric().
- Bersihkan kolom nilai_uas: Coba gunakan `pd.to_numeric(df_mahasiswa['nilai_uas'], errors='coerce').` Parameter `errors='coerce'` secara ajaib akan mengubah 'BELUM_UJIAN' menjadi NaN (Not a Number). (Simpan hasil bersih ini kembali ke kolom nilai_uas).
- Hitung Nilai Akhir (Tanpa Loop): Sekarang, buat kolom baru dalam satu baris: `df_mahasiswa['nilai_akhir'] = (df_mahasiswa['nilai_uts'] * 0.4) + (df_mahasiswa['nilai_uas'] * 0.6)`
- Cetak (print) `data_mahasiswa_df` lagi. Lihat apa yang terjadi pada nilai akhir Candra.

In [3]:
data_mahasiswa_df

     id    nama  nilai_uts    nilai_uas
0  M001    Budi         85           90
1  M002     Ani         70           85
2  M003  Candra         90  BELUM_UJIAN
3  M004    Dewi         50           65

In [4]:
import numpy as np

data_mahasiswa_df['nilai_uas'].unique()

array([90, 85, 'BELUM_UJIAN', 65], dtype=object)

In [5]:
# change column nilai_uas
# import numpy as np
# data_mahasiswa_df['nilai_uas'] = data_mahasiswa_df['nilai_uas'].replace('BELUM_UJIAN', np.nan)

data_mahasiswa_df['nilai_uas'] = pd.to_numeric(data_mahasiswa_df['nilai_uas'], errors='coerce')
print("Data Mahasiswa setelah mengubah kolom nilai_uas:", data_mahasiswa_df, sep="\n")

print("=" * 50)
# adding new column nilai_akhir
data_mahasiswa_df['nilai_akhir'] = (data_mahasiswa_df['nilai_uts'] * 0.4) + (data_mahasiswa_df['nilai_uas'] * 0.6)

print("Data Mahasiswa setelah menambahkan kolom nilai_akhir:", data_mahasiswa_df, sep="\n")

Data Mahasiswa setelah mengubah kolom nilai_uas:
     id    nama  nilai_uts  nilai_uas
0  M001    Budi         85       90.0
1  M002     Ani         70       85.0
2  M003  Candra         90        NaN
3  M004    Dewi         50       65.0
==================================================
Data Mahasiswa setelah menambahkan kolom nilai_akhir:
     id    nama  nilai_uts  nilai_uas  nilai_akhir
0  M001    Budi         85       90.0         88.0
1  M002     Ani         70       85.0         79.0
2  M003  Candra         90        NaN          NaN
3  M004    Dewi         50       65.0         59.0

----

**Membuat Laporan Kelulusan (Boolean Filtering) Syarat lulus: nilai_akhir > 70.**

**Tugas: Buat sebuah DataFrame baru bernama mahasiswa_lulus.**
- Proses:
- Kemarin kita pakai for loop dan if.
- Hari ini, kita gunakan Boolean Filtering dalam satu baris: mahasiswa_lulus = df_mahasiswa[ df_mahasiswa['nilai_akhir'] > 70 ]
- Cetak (print) mahasiswa_lulus.

In [7]:
data_mahasiswa_df['mahasiswa_lulus'] = np.where(data_mahasiswa_df['nilai_akhir'] > 70, 'LULUS', 'TIDAK LULUS')
print("Data Mahasiswa mahasiswa lulus:", data_mahasiswa_df, sep="\n")

Data Mahasiswa mahasiswa lulus:
     id    nama  nilai_uts  nilai_uas  nilai_akhir mahasiswa_lulus
0  M001    Budi         85       90.0         88.0           LULUS
1  M002     Ani         70       85.0         79.0           LULUS
2  M003  Candra         90        NaN          NaN     TIDAK LULUS
3  M004    Dewi         50       65.0         59.0     TIDAK LULUS

----

**Mencari Data Spesifik (Querying) Dosen bertanya, "Berapa nilai akhir si Dewi?"**

**Tugas: Tampilkan seluruh baris data milik "Dewi".**

- Proses:
- Kemarin kita pakai for loop dan if mhs['nama'] == 'Dewi'.
- Hari ini, kita gunakan satu baris lagi: dewi = df_mahasiswa[ df_mahasiswa['nama'] == 'Dewi' ]
- Cetak (print) dewi.

In [ ]:
nilai_dewi = data_mahasiswa_df[ data_mahasiswa_df['nama'] == 'Dewi' ]
print("Data Mahasiswa milik Dewi:", nilai_dewi, sep="\n")

Data Mahasiswa milik Dewi:
     id  nama  nilai_uts  nilai_uas  nilai_akhir mahasiswa_lulus
3  M004  Dewi         50       65.0         59.0     TIDAK LULUS

- nama aja dewi gk lulus bjir